Repository: VALAWAI/C0_patient_treatment_ui
Catalog: src/main/webui/src/locale/messages.*.xlf
Languages: ca, es

# main_doctor_text
source: doctor works!
ca: La pàgina del doctor fuciona
es: La pagina del médico fuciona

# shared_not-found_title
source: Page not found
ca: Pàgina no trobada
es: Página no encontrada

# shared_not-found_message
source: The page you are looking for might have been removed, or its name changed, or it temporarily unavailable
ca: És possible que la pàgina que cerqueu s'hagi eliminat, el seu nom s'hagi canviat o que no estigui disponible temporalment
es: Es posible que la página que está buscando haya sido eliminada, haya cambiado de nombre o no esté disponible temporalmente

# shared_not-found_go-home
source: Go to home page
ca: Vés a la pàgina d'inici
es: Ir a la página de inicio

# shared_spict-scale-name-LOW
source: Low
ca: Baixa
es: Bajo

source: The name can not have more than 1024 characters.
ca: El nom no pot tenir més de 1024 caràcters.
es: El nombre no puede tener más de 1024 caracteres.

# main_doctor_patients_add-submit
source: Add
ca: Afegir
es: Añadir

# main_doctor_patients_add_code_page-title
source: Add patient
ca: Afegeix un pacient
es: Añadir paciente

# main_doctor_patients_add_code_added-success
source: Patient has been added
ca: S'ha afegit el pacient
es: El paciente ha sido añadido

# main_doctor_patients_add_code_add-error
source: Patient not add the patient
ca: No és pot afegir el pacient
es: No se puede añadir el paciente

# main_doctor_patients_delete_msg-content
source: Deleting a patient cannot be undone, so don't do it unless you're sure. In addition, this action will cause that all the treatment associated with this patient will also be removed.
ca: La supressió d'un pacient no es pot desfer, així que no ho feu tret que n'estigueu segur. A més, aquesta acció farà que també s'elimini tots els tractaments associats a aquest pacient.
es: La eliminación de un paciente no se puede deshacer, así que no lo hagas a menos que estés seguro. Además, esta acción provocará que también se elimine todo el tratamiento asociado a este paciente.

# main_doctor_patients_delete_ok-label
source: Delete
ca: Suprimeix
es: Eliminar

# main_doctor_patients_delete_cancel-label
source: Cancel
ca: Cancel·la
es: Cancelar

# main_doctor_patients_delete_code_page-title
source: Delete patient
ca: Elimina el pacient
es: Eliminar referencia del paciente

# main_doctor_patients_delete_code_success-msg
source: Patient deleted
ca: Pacient eliminat
es: Paciente eliminado

# main_doctor_patients_delete_code_error-msg
source: Patient cannot be deleted
ca: No es pot eliminar el pacient
es: No se puede borrar el Paciente.

# main_doctor_patients_edit_update
source: Update
ca: Actualitza
es: Actualizar

# main_doctor_patients_edit_code_page-title
source: Edit patient information
ca: Edita la informació del pacient
es: Editar datos del Paciente

# main_doctor_patients_edit_code_update-success
source: Updated patient
ca: Pacient actualitzat
es: Paciente actualizado

# main_doctor_patients_edit_code_update-error
source: Patient not updated
ca: Pacient no actualitzat
es: Paciente no actualizado

# main_doctor_patients_search-placeholder
source: Write a patient name
ca: Escriu el nom del pacient
es: Escriba el nombre de un paciente

# main_doctor_patients_add-label
source: Add
ca: Afegir
es: Añadir

# main_doctor_patients_view-patient-menu-item-label
source: View
ca: Visualització
es: Ver

# main_doctor_patients_edit-patient-menu-item-label
source: Edit
ca: Edició
es: Editar

# main_doctor_patients_delete-patient-menu-item-label
source: Delete
ca: Supressió
es: Eliminar

# main_doctor_patients_code_page-title
source: Patients
ca: Pacients
es: Pacientes

# main_doctor_treatments_delete_code_page-title
source: Delete treatment
ca: Elimina el tractament
es: Eliminar tratamiento

# main_doctor_patients_treatment_action-required
source: You must select at least one action to do.
ca: Has de seleccionar com a mínim una acció.
es: Debe seleccionar al menos una acción a realizar.

# main_doctor_patients_treatment_step2-label
source: Select treatment actions to do over the patient
ca: Seleccionar les accions de tractament a realitzar sobre el pacient
es: Seleccionar las acciones de tratamiento a realizar sobre el paciente

# main_doctor_patients_treatment_step2-instructions
source: Now you must select the actions that should be applied to the patient as their treatment plan. You must select at least one action.
ca: Ara cal seleccionar les accions que s'han d'aplicar al pacient com a pla de tractament. Heu de seleccionar almenys una acció.
es: Ahora se deben seleccionar las acciones que se deben aplicar al paciente como su plan de tratamiento. Debes seleccionar al menos una acción.

# common_stepper_previous
source: Previous
ca: Anterior
es: Anterior

# common_stepper_next
source: Next
ca: Següent
es: Siguiente.

# main_doctor_patients_treatment_step3-label
source: Select the expected state after the treatment
ca: Selecciona l'estat previst després del tractament
es: Seleccione el estado esperado después del tratamiento

# main_doctor_patients_treatment_step4-label
source: Add treatment to the patient
ca: Afegir tractament al pacient
es: Añadir tratamiento al paciente

# main_doctor_patients_treatment_add-label
source: Add treatment to <span class="font-bold">{{patient.name}}</span>
ca: Afegir tractament al pacient <span class="font-bold">{{patient.name}}</span>
es: Añadir tratamiento al paciente <span class="font-bold">{{patient.name}}</span>

# main_doctor_patients_treatment_code_page-title
source: Add treatment to a patient
ca: Afegeix tractament a un pacient
es: Añadir tratamiento a un paciente

# main_doctor_patients_edit_code_add-error
source: Canot add the treatment
ca: No es pot afegir el tractament
es: No se puede añadir el tratamiento

# main_doctor_patients_view_code_page-title
source: View patient information
ca: Mostra la informació del pacient
es: Información del paciente

# main_doctor_treatments_delete_msg-title
source: Delete the treatment for the patient <span class="font-bold">{{treatment.patient?.name}}</span>
ca: Elimina el tractament per al pacient <span class="font-bold">{{treatment.patient?.name}}</span>
es: Eliminar el tratamiento del paciente <span class="font-bold">{{treatment.patient?.name}}</span>

# main_doctor_treatments_delete_msg-content
source: Deleting a treatment cannot be undone, so don't do it unless you're sure. In addition, this action will cause that all the feedbacks associated with this treatment will also be removed.
ca: L'eliminació d'un tractament no es pot desfer, així que no ho feu tret que n'estigueu segur. A més, aquesta acció farà que també s'eliminin tots els feedbacks associats a aquest tractament.
es: La eliminación de un tratamiento no se puede deshacer, así que no lo hagas a menos que estés seguro. Además, esta acción hará que también se eliminen todas las retroalimentaciones asociadas a este tratamiento.

# main_doctor_treatments_delete_ok-label
source: Delete
ca: Supressió
es: Eliminar

# main_doctor_treatments_delete_cancel-label
source: Cancel
ca: Cancel·la
es: Cancelar

# main_doctor_treatments_delete_code_error-msg
source: Treatment cannot be deleted
ca: El tractament no es pot eliminar
es: El tratamiento no se puede eliminar

# main_doctor_treatments_search-placeholder
source: Write a patient name
ca: Escriu el nom del pacient
es: Escriba el nombre de un paciente

# main_doctor_treatments_view-treatment-menu-item-label
source: View
ca: Visualització
es: Ver

# main_doctor_treatments_do-again-treatment-menu-item-label
source: Do it again
ca: Fes-ho una altra vegada
es: Hazlo de nuevo

# main_doctor_treatments_delete-treatment-menu-item-label
source: Delete
ca: Supressió
es: Eliminar

# main_doctor_treatments_new-treatment-for-patient-menu-item-label
source: New treatment for patient
ca: Nou tractament per al pacient
es: Nuevo tratamiento para el paciente

# main_doctor_treatments_code_page-title
source: Treatments
ca: Tractaments
es: Tratamientos

# main_doctor_treatments_view_before-status-title
source: Before status
ca: Estat d'abans
es: Estado antes del tratamiento

# main_doctor_treatments_view_before-status-description
source: The patient status before to apply the treatment
ca: L'estat del pacient abans d'aplicar el tractament
es: El estado del paciente antes de aplicar el tratamiento

# main_doctor_treatments_view_actions-title
source: Actions
ca: Accions
es: Acciones

# main_doctor_treatments_view_actions-description
source: The actions to do over the patient for this treatment
ca: Les accions a realitzar sobre el pacient per a aquest tractament
es: Las acciones a realizar sobre el paciente para este tratamiento

# main_doctor_treatments_view_action-feedback-allow
source: The NIT protocol allow to do this action.
ca: El protocol NIT permet fer aquesta acció.
es: El protocolo NIT permite realizar esta acción.

# main_doctor_treatments_view_action-feedback-deny
source: The NIT protocol does NOT allow to do this action.
ca: El protocol NIT NO permet fer aquesta acció.
es: El protocolo NIT NO permite realizar esta acción.

# main_doctor_treatments_view_action-feedback-unknown
source: I don't have enough information to know if the action is aligned with the protocol.
ca: No tinc prou informació per saber si l'acció està alineada amb el protocol.
es: No tengo suficiente información para saber si la acción está alineada con el protocolo.

# main_doctor_treatments_view_no-actions-message
source: At the moment this treatment does not have any associated action.
ca: De moment aquest tractament no té cap acció associada.
es: Por el momento este tratamiento no tiene ninguna acción asociada.

# main_doctor_treatments_view_expected-status-title
source: Expected status
ca: Estat previst
es: Estado esperado

# main_doctor_treatments_view_expected-status-description
source: The expected patient status after apply this treatment
ca: L'estat previst del pacient després d'aplicar aquest tractament
es: El estado esperado del paciente después de aplicar este tratamiento

# main_doctor_treatments_view_values-title
source: Values
ca: Valors
es: Valores

# main_doctor_treatments_view_values-description
source: The values to do over the patient for this treatment
ca: Els valors a fer sobre el pacient per a aquest tractament
es: Los valores a hacer sobre el paciente para este tratamiento

# main_doctor_treatments_view_no-values-message
source: At the moment this treatment does not have any associated value.
ca: De moment aquest tractament no té cap valor associat.
es: Por el momento este tratamiento no tiene ningún valor asociado.

# main_patients-menu-item-label
source: Patients
ca: Pacients
es: Pacientes

# main_treatments-menu-item-label
source: Treatments
ca: Tractaments
es: Tratamientos

# main_status-menu-item-label
source: Status
ca: Estat
es: Estado

# main_status_version-label
source: Version:
ca: Versió:
es: Versión:

# main_status_profile-label
source: Profile:
ca: Perfil
es: Perfil:

# main_status_health-label
source: Health:
ca: Salut:
es: Salud:

# main_status_code_page-title
source: Status
ca: Estat
es: Estado

# shared_barthel-index-name-SEVERE
source: 21 - 60% Severe
ca: 21 - 60% Greu
es: 21 - 60% Grave

# shared_barthel-index-name-MILD
source: 91 - 99% Mild
ca: 91 - 99% Lleu
es: 91 - 99% Leve

# shared_barthel-index-name-INDEPENDENT
source: 100% Independent
es: 100 % independiente

# shared_barthel-index-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_clinical-risk-group-option-name-PROMOTION_AND_PREVENTION
source: 0 Promotion & Prevention
ca: 0 Promoció i prevenció
es: 0 Promoción y prevención

# shared_clinical-risk-group-option-name-SELF_MANAGEMENT_SUPPORT
source: 1 Self-management support
ca: 1 Suport a l'autogestió
es: 1 Apoyo a la autogestión

# shared_clinical-risk-group-option-name-CASE_MANAGEMENT
source: 3 Case management
ca: 3 Gestió de casos
es: 3 Gestión de casos

# shared_clinical-risk-group-option-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_cognitive-impairment-level-name-ABSENT
source: Absent
es: Ausente

# shared_cognitive-impairment-level-name-MILD_MODERATE
source: Mild moderate
ca: Moderat lleu
es: Leve Moderado

# shared_cognitive-impairment-level-name-SEVERE
source: Severe
ca: Greu
es: Grave

# shared_cognitive-impairment-level-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_disconfort-degree-name-LOW
source: Low
ca: Baix
es: Bajo

# shared_disconfort-degree-name-MEDIUM
source: Medium
ca: Mitjà
es: Mediano

# shared_disconfort-degree-name-HIGH
source: High
ca: Alt
es: Alto

# shared_disconfort-degree-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_lawton-index-name-ZERO
source: 0 points
ca: 0 punts
es: 0 puntos

# shared_lawton-index-name-ONE
source: 1 point
ca: 1 punt
es: 1 punto

# shared_lawton-index-name-TWO
source: 2 points
ca: 2 punts
es: 2 puntos

# shared_lawton-index-name-FOUR
source: 4 points
ca: 4 punts
es: 4 puntos

# shared_lawton-index-name-FIVE
source: 5 points
ca: 5 punts
es: 5 puntos

# shared_lawton-index-name-SIX
source: 6 points
ca: 6 punts
es: 6 puntos

# shared_lawton-index-name-SEVEN
source: 7 points
ca: 7 punts
es: 7 puntos

# shared_lawton-index-name-EIGHT
source: 8 points
ca: 8 punts
es: 8 puntos

# shared_lawton-index-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_nit-level-name-ONE
source: 1 Treatment without limits
ca: 1 Tractament sense límits
es: 1 Tratamiento sin límites

# shared_nit-level-name-TWO_A
source: 2A Intense treatment
ca: 2A Tractament intens
es: 2A Tratamiento intenso

# shared_nit-level-name-TWO_B
source: 2B Intense treatment
ca: 2B Tractament intens
es: 2B Tratamiento intenso

# shared_nit-level-name-THREE
source: 3 Treatment of intermediate intensity
ca: 3 Tractament d'intensitat intermèdia
es: 3 Tratamiento de intensidad intermedia

# shared_nit-level-name-FOUR
source: 4 Symptomatic conservative treatment
ca: 4 Tractament conservador simptomàtic
es: 4 Tratamiento conservador sintomático

# shared_spict-scale-name-HIGH
source: High
ca: Alta
es: Alto

# shared_spict-scale-name-UNKNOWN
source: Unknown
ca: Desconeguda
es: Desconocido

# shared_survival-name-LESS_THAN_12_MONTHS
source: < 12 months
ca: < 12 mesos
es: < 12 meses

# shared_survival-name-MORE_THAN_12_MONTHS
source: > 12 months
ca: > 12 mesos
es: > 12 meses

# shared_survival-name-UNKNOWN
source: Unknown
ca: Desconeguda
es: Desconocido

# shared_treatment-action-name_CPR
source: Cardiopulmonary resuscitation (CPR)
ca: Reanimació cardiopulmonar (RCP)
es: Reanimación cardiopulmonar (RCP)

# shared_treatment-action-name_TRANSPLANT
source: Transplant
ca: Trasplantament
es: Trasplante

# shared_treatment-action-name_ICU
source: Intense care unit (ICU)
ca: Unitat d'Atenció Intensa (UCI)
es: Unidad de cuidados intensivos (UCI)

# shared_treatment-action-name_NIMV
source: Non-invasive mechanical ventilation (NIMV)
ca: Ventilació mecànica no invasiva (NIMV)
es: Ventilación mecánica no invasiva (NIMV)

# shared_treatment-action-name_VASOACTIVE_DRUGS
source: Vasoactive drugs
ca: Medicaments vasoactius
es: Drogas vasoactivas

# shared_treatment-action-name_DIALYSIS
source: Dialysis
ca: Diàlisi renal
es: Diálisis

# shared_treatment-action-name_MEDIUM_CLINICAL_TRIAL
source: Medium clinical trials: Computed tomography / Transfusion / Peripherally placed central catheter / Enteral administration
ca: Assaigs clínics mitjans: Tomografia computada / Transfusió / Cateter central col·locat perifèricament /Administració enteral
es: Ensayos clínicos medios: Tomografía computarizada / Transfusión / Catéter central colocado periféricamente/Administración enteral

# shared_treatment-action-name_ADVANCED_CLINICAL_TRIAL
source: Advanced clinical trials: MRI / Endoscopy / Parenteral nutrition
ca: Assaigs clínics avançats: RMN / Endoscòpia /Nutrició parenteral
es: Ensayos clínicos avanzados: RMN / endoscopia /nutrición parenteral

# shared_treatment-action-name_PALLIATIVE_SURGERY
source: Palliative surgery
ca: Cirurgia pal·liativa
es: Cirugía paliativa

# shared_treatment-action-name_CURE_SURGERY
source: Cure surgery
ca: Cirurgia de curació
es: Curar cirugía

# shared_treatment-value-name_beneficence
source: Beneficence
ca: Beneficència
es: Beneficencia

# shared_treatment-value-name_nonmaleficence
source: Nonmaleficence
ca: No maleficència
es: No maleficencia

# shared_treatment-value-name_autonomy
source: Autonomy
ca: Autonomia
es: Autonomía

# shared_treatment-value-name_justice
source: Justice
ca: Justícia
es: Justicia

# shared_yes-no-unknown-name-YES
source: Yes
ca: Sí
es: Sí

# shared_yes-no-unknown-name-UNKNOWN
source: Unknown
ca: Desconegut
es: Desconocido

# shared_patient-status-criteria-editor_maca-answer_explanation
source: (Would you be surprised if the patient died in less than 12 months? If the answer is NO, the patient is MACA)
ca: (Et sorprendria que el pacient morís en menys de 12 mesos? Si la resposta és NO, el pacient és MACA)
es: (¿Le sorprendería si el paciente muriera en menos de 12 meses? Si la respuesta es NO, el paciente es MACA)

# shared_patient-status-criteria-editor_expected-survival-question
source: Life expectancy / Expected survival (in months)
ca: Esperança de vida/Supervivència esperada (en mesos)
es: Esperanza de vida /Supervivencia esperada (en meses)

# shared_patient-status-criteria-editor_frail-vig-question
source: Frail-VIG fragility index (Spict scale)
ca: Índex de fragilitat Fragil-VIG (escala Spict)
es: Índice de fragilidad frágil-VIG (escala Spict)

# shared_patient-status-criteria-editor_clinical-risk-group-question
source: Clinical Risk Group
ca: Grup de risc clínic
es: Grupo de riesgo clínico

# shared_patient-status-criteria-editor_has-social-support-question
source: Does the patient have social support?
ca: Té el pacient suport social?
es: ¿Tiene el paciente apoyo social?

# shared_patient-status-criteria-editor_independence-at-admission-question
source: Barthel index
ca: Índex de Barthel
es: Índice de Barthel

source: Functional independence for basic activities of daily living at admission.
ca: Independència funcional per a les activitats bàsiques de la vida diària en l'ingrés.
es: Independencia funcional para las actividades básicas de la vida diaria en el momento del ingreso.

source: Lawton index
ca: Índex Lawton
es: Índice Lawton

source: Independence instrumental activities.
ca: Activitats instrumentals independentistes.
es: Actividades instrumentales de independencia.

# shared_patient-status-criteria-editor_has-advance-directives-question
source: Does the patient have advance directives?
ca: El pacient té directrius anticipades?
es: ¿El paciente tiene instrucciones anticipadas?

# shared_patient-status-criteria-editor_is-competent-question
source: Is the patient competent to understand the instructions of health personnel?
ca: És el pacient competent per entendre les instruccions del personal sanitari?
es: ¿El paciente es competente para entender las instrucciones del personal de salud?

# shared_patient-status-criteria-editor_has-been-informed-question
source: To the patient or his/her referent authorized has been informed of possible treatments and the consequences of receiving it or No?
ca: Al pacient o al seu referent autoritzat se li ha informat dels possibles tractaments i de les conseqüències de rebre'ls o No?
es: Al paciente o su referente autorizado se le ha informado de los posibles tratamientos y las consecuencias de recibirlo o No?

# shared_patient-status-criteria-editor_is-coerced-question
source: Is it detected that the patient has seen coerced/pressured by third parties?
ca: Es detecta que el pacient ha vist coaccionat/pressionat per tercers?
es: ¿Se detecta que el paciente ha visto coaccionado/presionado por terceros?

# shared_patient-status-criteria-editor_emotional-state-question
source: Emotional state. Does the patient have emotional discomfort?
ca: Estat emocional. El pacient té molèsties emocionals?
es: Estado emocional. ¿El paciente tiene malestar emocional?

# shared_patient-status-criteria_main_nit-level-question
source: NIT Level
ca: Nivell NIT
es: Nivel NIT

# main_doctor_patients_delete_msg-title
source: Delete the patient <span class="font-bold">{{patient.name}}</span>
ca: Eliminar el pacient <span class="font-bold">{{patient.name}}</span>
es: Eliminar el paciente <span class="font-bold">{{patient.name}}</span>

# shared_lawton-index-name-THREE
source: 3 points
ca: 3 punts
es: 3 puntos

# shared_spict-scale-name-MODERATE
source: Moderate
ca: Moderada
es: Moderado

# shared_patient-status-criteria-editor_maca-question_explanation
source: This is a classification of patients with a clinical profile similar to PCC but of greater severity and with a life prognosis of less than 12 months. Patients classified as MACA = patients whose The answer to the next question is NO: do you It would be surprising if this patient died in less than 12 months?
ca: Es tracta d'una classificació de pacients amb un perfil clínic similar al PCC però de major gravetat i amb un pronòstic de vida inferior als 12 mesos. Pacients classificats com a MACA = pacients dels quals La resposta a la següent pregunta és NO: et sorprendria que aquest pacient morís en menys de 12 mesos?
es: Se trata de una clasificación de pacientes con un perfil clínico similar al PCC pero de mayor gravedad y con un pronóstico de vida inferior a 12 meses. Pacientes clasificados como MACA = pacientes cuyo La respuesta a la siguiente pregunta es NO: ¿Sería sorprendente que este paciente muriera en menos de 12 meses?

# main_doctor_patients_treatment_step1-instructions
source: Before adding a treatment to a patient, it's crucial to assess their current status. This involves completing a series of questions, completing the next form that outlines various patient criteria.
ca: Abans d'afegir un tractament a un pacient, és crucial avaluar el seu estat actual. Això implica completar una sèrie de preguntes, completant el següent formulari que descriu diversos criteris del pacient.
es: Antes de agregar un tratamiento a un paciente, es fundamental evaluar su estado actual. Esto implica completar una serie de preguntas y completar el siguiente formulario que describe varios criterios del paciente.

# main_doctor_treatments_view_code_page-title
source: View treatment information
ca: Mostra la informació del tractament
es: Información sobre el tratamiento

# main_doctor_treatments_view_code_do-again-error
source: Cannot do again this treatment.
ca: No es pot tornar a fer aquest tractament.
es: No se puede volver a realizar este tratamiento.

# shared_treatment-action-name_SIMPLE_CLINICAL_TRIAL
source: Simple clinical trials: X-rays / Analytics / Cultures / Antibodies
ca: Assaigs clínics senzills: radiografies / anàlisis / cultius / anticossos
es: Ensayos clínicos sencillos: Rayos X / Analítica / Cultivos / Anticuerpos

# shared_patient-status-criteria-editor_ccd-question
source: Complex Cronic Disease (CCD)
ca: Malaltia crònica complexa (CCD)
es: Enfermedad Crónica Compleja (CCD)

# shared_patient-status-criteria-editor_has-cognitive-impairment-question
source: Does the patient have cognitive impairment?
ca: Té el pacient deteriorament cognitiu?
es: ¿El paciente tiene deterioro cognitivo?

# main_doctor_patients_edit_name
source: Patient name
ca: Nom del pacient
es: Nombre del paciente

source: You must define a name of the patient.
ca: Heu de definir un nom del pacient.
es: Debe definir un nombre del paciente.

# main_doctor_patients_treatment_step1-label
source: Current staus of <span class="font-bold">{{patient.name}}</span>
ca: L'estat actual del pacient <span class="font-bold">{{patient.name}}</span>
es: El estado actual del paciente <span class="font-bold">{{patient.name}}</span>
