Repository: VALAWAI/C0_patient_treatment_ui
Catalog: src/main/webui/src/locale/messages.*.xlf
Languages: ca, es

# main_doctor_patients_treatment_step3-instructions
source: After selecting the treatment action to be performed on the patient, you must define the expected status for the patient after these actions have been applied. To this end, you must fill in the following form. In this form, you can only edit the criteria that can be changed by the treatment actions.
ca: Després de seleccionar l'acció de tractament que s'ha de dur a terme al pacient, cal definir l'estat esperat del pacient després d'haver aplicat aquestes accions. Per a això, heu d'omplir el següent formulari. En aquest formulari, només podeu editar els criteris que es poden modificar mitjançant les accions de tractament.
es: Después de seleccionar la acción de tratamiento que se realizará en el paciente, debe definir el estado esperado para el paciente después de que se hayan aplicado estas acciones. Para ello deberá rellenar el siguiente formulario. De este formulario, sólo se pueden editar los criterios que pueden ser modificados por las acciones de tratamiento.

# main_doctor_treatments_delete_code_success-msg
source: Treatment deleted
ca: Tractament eliminat
es: Tratamiento eliminado

# main_doctor_treatments_code_do-again-error
source: Cannot do again the treatment for the patient.
ca: No es pot tornar a fer el tractament per al pacient.
es: No se puede volver a realizar el tratamiento para el paciente.

# main_doctor_treatments_view_header-title
source: Treatment for patient <a class="underline text-blue-800" [routerLink]="['/main/doctor/patients',treatment.patient?.id,'view']"> {{treatment.patient?.name}}</a>
ca: Tractament pe al pacient <a class="underline text-blue-800" [routerLink]="['/main/doctor/patients',treatment.patient?.id,'view']"> {{treatment.patient?.name}}</a>
es: Tratamiento del paciente <a class="underline text-blue-800" [routerLink]="['/main/doctor/patients',treatment.patient?.id,'view']"> {{treatment.patient?.name}}</a>

# shared_barthel-index-name-MODERATE
source: 61 - 90% Moderate
ca: 61 - 90% Moderat
es: 61 - 90% Moderado

# main_doctor_patients_patient-treatment-menu-item-label
source: Add treatment
ca: Afegeix un tractament
es: Añadir tratamiento

# main_doctor_patients_treatment_step4-instructions
source: Once you've defined the patient's current status, the planned treatment actions, and the expected outcome, you can add the treatment plan to the patient's record. This allows for obtaining feedback on the treatment's effectiveness, especially if the actions comply with the NIT protocol and the treatment aligns with the patient's values.
ca: Un cop hàgiu definit l'estat actual del pacient, les accions de tractament previstes i el resultat esperat, podeu afegir el pla de tractament al registre del pacient. Això permet obtenir feedback sobre l'eficàcia del tractament, sobretot si les accions compleixen el protocol NIT i el tractament s'alinea amb els valors del pacient.
es: Una vez que haya definido el estado actual del paciente, las acciones de tratamiento planificadas y el resultado esperado, puede agregar el plan de tratamiento al registro del paciente. Esto permite obtener retroalimentación sobre la efectividad del tratamiento, especialmente si las acciones cumplen con el protocolo NIT y el tratamiento se alinea con los valores del paciente.

# shared_nit-level-name-FIVE
source: 5 Exclusively comfort measures
ca: 5 Mesures de confort exclusives
es: 5 Medidas de confort exclusivas

# shared_patient-status-criteria-editor_maca-question
source: MACA patient (advance chronic disease and need for palliative care)
ca: Pacient de MACA (malaltia crònica avançada i necessitat de cures pal·liatives)
es: Paciente con MACA (enfermedad crónica avanzada y necesidad de cuidados paliativos)

# shared_clinical-risk-group-option-name-ILLNESS_MANAGEMENT
source: 2 Illness management
ca: 2 Gestió de malalties
es: 2 Manejo de enfermedades

# shared_patient-status-criteria-editor_frail-vig-question_explanation
source: It helps identify the most fragile people who have one or more health problems. It is based on the comprehensive geriatric assessment (applicable to non-geriatric patients) that evaluates areas such as functional independence, nutritional status, cognitive, emotional, social, geriatric syndromes (confusion syndrome, falls, ulcers, polypharmacy, dysphagia), symptoms (pain or dyspnea) and diseases oncological, respiratory, cardiac, neurological, digestive or renal).
ca: Ajuda a identificar les persones més fràgils que tenen un o més problemes de salut. Es basa en l'avaluació geriàtrica integral (aplicable a pacients no geriàtrics) que avalua àrees com la independència funcional, l'estat nutricional, les síndromes cognitives, emocionals, socials, geriàtriques (síndrome de confusió, caigudes, úlceres, polifarmàcia, disfàgia), símptomes ( dolor o dispnea) i malalties oncològiques, respiratòries, cardíaques, neurològiques, digestives o renals).
es: Ayuda a identificar a las personas más frágiles que tienen uno o más problemas de salud. Se basa en la valoración geriátrica integral (aplicable a pacientes no geriátricos) que evalúa áreas como independencia funcional, estado nutricional, síndromes cognitivos, emocionales, sociales, geriátricos (síndrome de confusión, caídas, úlceras, polifarmacia, disfagia), síntomas ( dolor o disnea) y enfermedades oncológicas, respiratorias, cardíacas, neurológicas, digestivas o renales).

# shared_patient-status-criteria-editor_age-range-question
source: Patient age range
ca: Interval d'edat del pacient
es: Rango de edad del paciente

# shared_patient-status-criteria-editor_disconfort-degree-question
source: Degree of discomfort/discomfort of the patient before applying any action.
ca: Grau de malestar/incomoditat del pacient abans d'aplicar qualsevol acció.
es: Grado de malestar/incomodidad del paciente antes de aplicar cualquier acción.
